Config/Enums/СпособыУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыУчетаНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УчитываетсяВСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаетсяКВычету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распределяется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/КВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КВД</Name>
			<Comment>Коды финансового обеспечения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Деятельность, осуществляемая за счет средств соответствующего бюджета бюджетной системы Российской Федерации (бюджетная деятельность)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внебюджет</Name>
					<Comment>Приносящая доход деятельность (собственные доходы учреждения)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеРаспоряжение</Name>
					<Comment>Средства во временном распоряжении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаГосзадание</Name>
					<Comment>Деятельность по выполнению государственного (муниципального) задания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаИныеЦели</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на иные цели, грантов в форме субсидий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетныеИнвестиции</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на цели осуществления капитальных вложений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваОМС</Name>
					<Comment>Деятельность, осуществляемая по обязательному медицинскому страхованию</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/РезультатыГолосованияЧленовКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РезультатыГолосованияЧленовКомиссии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>За</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Против</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/УправлениеНФАКлиентСервер/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ НФА, КЛИЕНСЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ                           //
//////////////////////////////////////////////////////////////////////////////////
	
#Область ПрограммныйИнтерфейс

// ОБРАБОТКА ТАБЛИЧНЫХ ЧАСТЕЙ

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  УчитыватьНДС     - булево, признак учета НДС в сумме, 
//  СуммаВключаетНДС - булево, признак включения НДС в сумму ("внутри" или "сверху"),
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС) Экспорт

	Если СуммаВключаетНДС Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаНДС = Сумма * СтавкаНДС / 100;
	КонецЕсли;

	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()

// Расчет, исходя из постоянной суммы
//
// Параметры:
//  СтруктураПараметров - Структура с ключами "Сумма" и "СтавкаНДС",
//  СуммаВключаетНДС     - Булево.
//
Функция РассчитатьСуммуНДСТабЧасти(СтруктураПараметров, СуммаВключаетНДС = Ложь) Экспорт

	Результат = 0;
	Если СтруктураПараметров.Свойство("Сумма") И СтруктураПараметров.Свойство("СтавкаНДС") Тогда
		Результат = РассчитатьСуммуНДС(СтруктураПараметров.Сумма, СуммаВключаетНДС,
										УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтруктураПараметров.СтавкаНДС));
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Рассчитывает сумму "Всего" в строке табличной части документа
//
// Параметры:
//  СтруктураПараметров - Структура с ключами "Сумма" и "СуммаНДС",
//
Функция РассчитатьВсегоТабЧасти(СтруктураПараметров, СуммаВключаетНДС = Ложь) Экспорт
	
	Возврат (СтруктураПараметров.Сумма + ?(СуммаВключаетНДС, 0, СтруктураПараметров.СуммаНДС));

КонецФункции

// Рассчитывает сумму в строке табличной части документа
//
//  СтруктураПараметров - Структура с ключами "Цена" и "Количество",
//
Функция РассчитатьСуммуТабЧасти(СтруктураПараметров) Экспорт

	Возврат(СтруктураПараметров.Цена * СтруктураПараметров.Количество);

КонецФункции

// Рассчитывает цену в строке табличной части документа
//
//  СтруктураПараметров - Структура с ключами "Сумма" и "Количество",
//
Функция РассчитатьЦенуТабЧасти(СтруктураПараметров) Экспорт

	Возврат(?(СтруктураПараметров.Количество = 0, 0, СтруктураПараметров.Сумма / СтруктураПараметров.Количество));

КонецФункции

// Процедура выполняет стандартные действия при изменении реквизита "Всего" 
// в строке табличной части документа.
//
// Параметры:
//  СтруктураПараметров - Структура с ключами "Всего" и "СтавкаНДС", "Количество",
//  СтрокаРеквизитов     - Строка. Реквизиты, которые нужно расчитать, через запятую. 
//							Может содержать: "Сумма", "СуммаНДС", "Цена"
//
Функция ПриИзмененииВсегоТабЧасти(СтруктураПараметров, СтрокаРеквизитов, СуммаВключаетНДС = Ложь) Экспорт
	СтруктураРезультат = Новый Структура(СтрокаРеквизитов);
    МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРеквизитов);

	Если МассивРеквизитов.Найти("СуммаНДС") <> Неопределено Тогда
		СтруктураРезультат.СуммаНДС = РассчитатьСуммуНДС(СтруктураПараметров.Всего,
			Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтруктураПараметров.СтавкаНДС));
	КонецЕсли;	
	
	Если МассивРеквизитов.Найти("Сумма") <> Неопределено Тогда
		СуммаНДС = СтруктураПараметров.СуммаНДС;
		Если СтруктураРезультат.Свойство("СуммаНДС") Тогда
			СуммаНДС = СтруктураРезультат.СуммаНДС;
		КонецЕсли;
		СтруктураРезультат.Сумма = ?(СуммаВключаетНДС, СтруктураПараметров.Всего, СтруктураПараметров.Всего - СуммаНДС);
	КонецЕсли;	
	
	Если МассивРеквизитов.Найти("Цена") <> Неопределено Тогда
		СтруктураПараметровДляЦены = Новый Структура("Сумма, Количество", СтруктураРезультат.Сумма, СтруктураПараметров.Количество);
		СтруктураРезультат.Цена = РассчитатьЦенуТабЧасти(СтруктураПараметровДляЦены);
	КонецЕсли;	
	
	Возврат(СтруктураРезультат);
КонецФункции

// Рассчитывает количество исходя из количества мест
//
// Параметры:
//  СтруктураПараметров - Структура с ключами "КоличествоМест" и "Коэффициент"
//
Функция РассчитатьКоличествоТабЧасти(СтруктураПараметров) Экспорт

	Возврат(СтруктураПараметров.КоличествоМест * СтруктураПараметров.Коэффициент);

КонецФункции

// Процедура выполняет стандартные действия при изменении суммы 
// в строке табличной части документа.
//
// Параметры:
//  СтруктураПараметров - Структура с ключами "Количество" и "Сумма"
//
Функция РасчитатьЦенуПриИзмененииСуммыТабЧасти(СтруктураПараметров, ЗначениеПустогоКоличества = 0) Экспорт

	Результат = 0;
	РасчетноеКоличество = ?(СтруктураПараметров.Количество = 0, ЗначениеПустогоКоличества, СтруктураПараметров.Количество);
	Если РасчетноеКоличество <> 0 Тогда
		Результат = СтруктураПараметров.Сумма / РасчетноеКоличество;
	КонецЕсли; 

	Возврат Результат;
КонецФункции

// Параметры расчета строки документа для процедуры РассчитатьСтрокуДокумента.
// 
// Возвращаемое значение:
//  Структура - Параметры расчета строки документа:
//   * ИмяРеквизитаКоличество - Строка - 
//   * ИмяРеквизитаЦена - Строка - 
//   * ИмяРеквизитаСумма - Строка - 
//   * ИмяРеквизитаСтавкаНДС - Строка - 
//   * ИмяРеквизитаСуммаНДС - Строка - 
//   * ИмяРеквизитаВсего - Строка - 
//   * СуммаВключаетНДС - Булево - 
//   * РассчитыватьЦену - Булево - 
Функция ПараметрыРасчетаСтрокиДокумента() Экспорт
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяРеквизитаКоличество", "Количество");
	Результат.Вставить("ИмяРеквизитаЦена", "Цена");
	Результат.Вставить("ИмяРеквизитаСумма", "Сумма");
	Результат.Вставить("ИмяРеквизитаСтавкаНДС", "СтавкаНДС");
	Результат.Вставить("ИмяРеквизитаСуммаНДС", "СуммаНДС");
	Результат.Вставить("ИмяРеквизитаВсего", "Всего");
	Результат.Вставить("СуммаВключаетНДС", Ложь);
	Результат.Вставить("РассчитыватьЦену", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Рассчитать строку документа.
// 
// Параметры:
//  СтрокаДокумента - ДанныеФормыЭлементКоллекции
//  ИмяКолонки - Строка
//  ПараметрыРасчета - см. ПараметрыРасчетаСтрокиДокумента
Процедура РассчитатьСтрокуДокумента(СтрокаДокумента, Знач ИмяКолонки, ПараметрыРасчета) Экспорт
	
	Параметры = ПараметрыРасчета;
	ИмяКолонки = ВРег(ИмяКолонки);
	СуммаВключаетНДС = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СуммаВключаетНДС", Ложь);
	РассчитыватьЦену = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "РассчитыватьЦену", Ложь);
	
	// Определим имена реквизитов строки документа.
	Количество = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяРеквизитаКоличество", "Количество");
	Цена       = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяРеквизитаЦена", "Цена");
	Сумма      = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяРеквизитаСумма", "Сумма");
	СтавкаНДС  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяРеквизитаСтавкаНДС", "СтавкаНДС");
	СуммаНДС   = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяРеквизитаСуммаНДС", "СуммаНДС");
	Всего      = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяРеквизитаВсего", "Всего");
	
	Если ИмяКолонки = "КОЛИЧЕСТВО" Или ИмяКолонки = "ЦЕНА" Тогда
		СтрокаДокумента[Сумма] = СтрокаДокумента[Количество] * СтрокаДокумента[Цена];
		ИмяКолонки = "СУММА";
	КонецЕсли;
	
	Если РассчитыватьЦену И ИмяКолонки = "СУММА" Тогда
		СтрокаДокумента[Цена] = ?(СтрокаДокумента[Количество] = 0,
			СтрокаДокумента[Сумма],
			СтрокаДокумента[Сумма] / СтрокаДокумента[Количество]);
	КонецЕсли;
	
	Если ИмяКолонки = "СУММА" Или ИмяКолонки = "СТАВКАНДС" Тогда
		СтавкаНДС = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(СтрокаДокумента[СтавкаНДС]);
		Если СуммаВключаетНДС Тогда
			СтрокаДокумента[СуммаНДС] = СтрокаДокумента[Сумма] * СтавкаНДС / (100 + СтавкаНДС);
		Иначе
			СтрокаДокумента[СуммаНДС] = СтрокаДокумента[Сумма] * СтавкаНДС / 100;
		КонецЕсли;
		ИмяКолонки = "СУММАНДС";
	КонецЕсли;
	
	Если ИмяКолонки = "СУММАНДС" Тогда
		Если Не СуммаВключаетНДС Тогда
			СтрокаДокумента[Всего] = СтрокаДокумента[Сумма] + СтрокаДокумента[СуммаНДС];
		Иначе
			СтрокаДокумента[Всего] = СтрокаДокумента[Сумма];
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяКолонки = "ВСЕГО" Тогда
		СтавкаНДС = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(СтрокаДокумента[СтавкаНДС]);
		СтрокаДокумента[СуммаНДС] = СтрокаДокумента[Всего] * СтавкаНДС / (100 + СтавкаНДС);
		
		Если СуммаВключаетНДС Тогда
			СтрокаДокумента[Сумма] = СтрокаДокумента[Всего];
		Иначе
			СтрокаДокумента[Сумма] = СтрокаДокумента[Всего] - СтрокаДокумента[СуммаНДС];
		КонецЕсли;
		
		Если РассчитыватьЦену Тогда
			СтрокаДокумента[Цена] = ?(СтрокаДокумента[Количество] = 0,
				СтрокаДокумента[Сумма],
				СтрокаДокумента[Сумма] / СтрокаДокумента[Количество]);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Заполнить способ учета НДСВСтроках.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура:
//   * ПринятьНДСКВычетуУказываетсяВСтроках - Булево
//   * ПринятьНДСКВычету - Булево
//  ТабличнаяЧасть - ДанныеФормыКоллекция:
//   * НДСКРаспределению - Булево
//   * ПринятьНДСКВычету - Булево
//   * СпособУчетаНДС - ПеречислениеСсылка.СпособыУчетаНДС
Процедура ЗаполнитьСпособУчетаНДСВСтроках(Объект, ТабличнаяЧасть) Экспорт
	
	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		
		Если Объект.ПринятьНДСКВычетуУказываетсяВСтроках Тогда
			ПринятьНДСКВычету = СтрокаТаблицы.ПринятьНДСКВычету;
		Иначе
			ПринятьНДСКВычету = Объект.ПринятьНДСКВычету;
		КонецЕсли;
		
		СтрокаТаблицы.СпособУчетаНДС = ЗначениеСпособУчетаНДС(ПринятьНДСКВычету, СтрокаТаблицы.НДСКРаспределению);
		
	КонецЦикла;
	
КонецПроцедуры

// Значение перечисления "СпособыУчетаНДС" по признакам учета.
//
// Параметры:
//  ПринятьНДСКВычету	 - Булево
//  НДСКРаспределению	 - Булево
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыУчетаНДС
//
Функция ЗначениеСпособУчетаНДС(ПринятьНДСКВычету, НДСКРаспределению) Экспорт
	Если ПринятьНДСКВычету Тогда
		Если НДСКРаспределению Тогда
			СпособУчетаНДС = ПредопределенноеЗначение("Перечисление.СпособыУчетаНДС.Распределяется");
		Иначе
			СпособУчетаНДС = ПредопределенноеЗначение("Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету");
		КонецЕсли;
	Иначе
		СпособУчетаНДС = ПредопределенноеЗначение("Перечисление.СпособыУчетаНДС.УчитываетсяВСтоимости");
	КонецЕсли;
	Возврат СпособУчетаНДС;
КонецФункции

// Заполнить данные учета НДС по способу учета.
// 
// Параметры:
//  СтрокаТаблицы - ДанныеФормыЭлементКоллекции:
//   * СпособУчетаНДС - ПеречислениеСсылка.СпособыУчетаНДС
//   * ПринятьНДСКВычету - Булево
//   * НДСКРаспределению - Булево
Процедура ЗаполнитьДанныеУчетаНДСПоСпособуУчета(СтрокаТаблицы) Экспорт
	
	Если СтрокаТаблицы.СпособУчетаНДС = ПредопределенноеЗначение("Перечисление.СпособыУчетаНДС.Распределяется") Тогда
		СтрокаТаблицы.ПринятьНДСКВычету = Истина;
		СтрокаТаблицы.НДСКРаспределению = Истина;
	ИначеЕсли СтрокаТаблицы.СпособУчетаНДС = ПредопределенноеЗначение("Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету") Тогда
		СтрокаТаблицы.ПринятьНДСКВычету = Истина;
		СтрокаТаблицы.НДСКРаспределению = Ложь;
	Иначе
		СтрокаТаблицы.ПринятьНДСКВычету = Ложь;
		СтрокаТаблицы.НДСКРаспределению = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСпособУчетаНДСПоУмолчаниюВСтроке(Объект, СтрокаТаблицы) Экспорт
	Если Объект.ПринятьНДСКВычетуУказываетсяВСтроках Тогда
		Если СтрокаТаблицы.КФО = ПредопределенноеЗначение("Перечисление.КВД.Внебюджет") Тогда
			СтрокаТаблицы.ПринятьНДСКВычету = Истина;
		Иначе
			СтрокаТаблицы.ПринятьНДСКВычету = Ложь;
		КонецЕсли;
	Иначе
		СтрокаТаблицы.ПринятьНДСКВычету = Объект.ПринятьНДСКВычету;
	КонецЕсли;
	СтрокаТаблицы.СпособУчетаНДС = ЗначениеСпособУчетаНДС(СтрокаТаблицы.ПринятьНДСКВычету, СтрокаТаблицы.НДСКРаспределению);
КонецПроцедуры

// Возвращает массив способов утилизации имущества.
// В основном используется для определения списка выбора в формах
//
// Возвращаемое значение:
//   Массив - значения типа Строка
Функция СпособыУтилизацииИмущества() Экспорт
	СпособыУтилизации = Новый Массив;
	СпособыУтилизации.Добавить("Самостоятельно субъектом учета");
	СпособыУтилизации.Добавить("С привлечением специализированной организации");
	
	Возврат СпособыУтилизации;
КонецФункции	

// Возвращает текст по умолчанию для подстановки в реквизит "Резолюция комиссии" в документах.
//
// Параметры:
//  ВидДокумента - Строка - Имя вида документа
// 
// Возвращаемое значение:
//  Строка - тект резолюции по умолчанию
Функция ТекстРезолюцииКомиссииПоУмолчанию(ВидДокумента) Экспорт
	ТекстРезолюции = "";
	Если ВидДокумента = "РешениеОПризнанииОбъектовОС"
		Или ВидДокумента = "РешениеОПризнанииОбъектовМЗ" Тогда
		ТекстРезолюции = "Готов к эксплуатации";
	КонецЕсли;	
	
	Возврат(ТекстРезолюции);	
КонецФункции

#Область АктПриемкиТоваровРаботУслуг

// Имена реквизитов ответственных лиц контрагентов - Акт приемки ТРУ.
// 
// Возвращаемое значение:
//  Структура из Строка - Имена реквизитов ответственных лиц контрагентов
Функция ИменаРеквизитовОтветственныхЛицКонтрагентовАктПриемкиТРУ() Экспорт
	ОбрабатываемыеПоля = Новый Структура;
	ОбрабатываемыеПоля.Вставить("ПредставительПоставщикаФИО", "ПредставительПоставщикаДолжность");
	ОбрабатываемыеПоля.Вставить("ПредставительЗаказчикаФИО", "ПредставительЗаказчикаДолжность");
	ОбрабатываемыеПоля.Вставить("РуководительЗаказчикаФИО", "РуководительЗаказчикаДолжность");
	ОбрабатываемыеПоля.Вставить("ПредставительСтроительныйКонтрольФИО", "ПредставительСтроительныйКонтрольДолжность");
	//@skip-check constructor-function-return-section
	Возврат ОбрабатываемыеПоля;
КонецФункции

// Установить свойства элементов ответственных лиц контрагентов - Акт приемки ТРУ.
// 
// Параметры:
//  Форма - см. Документ.АктПриемкиТоваровРаботУслуг.Форма.ФормаДокумента
//  Объект - Произвольный - форма или объект
Процедура УстановитьСвойстваЭлементовОтветственныхЛицКонтрагентовАктПриемкиТРУ(Форма, Объект) Экспорт
	ОбрабатываемыеПоля = ИменаРеквизитовОтветственныхЛицКонтрагентовАктПриемкиТРУ();
	ТипОтветственноеЛицо = Тип("СправочникСсылка.ОтветственныеЛицаКонтрагентов");
	Для Каждого КлючИЗначение Из ОбрабатываемыеПоля Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, КлючИЗначение.Ключ) Тогда
			ПроверяемоеПоле = Объект[КлючИЗначение.Ключ];
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, КлючИЗначение.Значение,
				"ТолькоПросмотр", (ЗначениеЗаполнено(ПроверяемоеПоле) И ТипЗнч(ПроверяемоеПоле) = ТипОтветственноеЛицо));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Создает описание связей параметров выбора для формы выбора значения контактного лица в "Акте приемки ТРУ".
// 
// Параметры:
//  РеквизитОрганизация - Строка
//  РеквизитКонтрагент - Строка
//  РодительскийРеквизит - Строка
//  ВыбранныйТип - Тип
// 
// Возвращаемое значение:
//  Массив из Структура:
//   * Имя - Строка
//   * ПутьКДанным - Строка
//   * Очищать - Булево
Функция СвязиПараметровВыбораДляФормыВыбораЗначенияФИОКонтактногоЛицаАктПриемкиТРУ(РеквизитОрганизация,
		РеквизитКонтрагент, РодительскийРеквизит, ВыбранныйТип) Экспорт
	СвязиПараметровВыбора = Новый Массив;
	Если ВыбранныйТип = Тип("СправочникСсылка.Сотрудники") Тогда
		СвязиПараметровВыбора.Добавить(
			Новый Структура("Имя, ПутьКДанным, Очищать",
				"Отбор.Владелец",
				?(РодительскийРеквизит = "", РеквизитОрганизация, РодительскийРеквизит + "." + РеквизитОрганизация),
				Истина));
	ИначеЕсли ВыбранныйТип = Тип("СправочникСсылка.ОтветственныеЛицаКонтрагентов") Тогда
		СвязиПараметровВыбора.Добавить(
			Новый Структура("Имя, ПутьКДанным, Очищать",
				"Отбор.Владелец",
				?(РодительскийРеквизит = "", РеквизитКонтрагент, РодительскийРеквизит + "." + РеквизитКонтрагент),
				Истина));
	КонецЕсли;
	Возврат СвязиПараметровВыбора;
КонецФункции

// Возвращает имя элемента из которого берется владелец ответственного лица.
// 
// Параметры:
//  ИмяЭлемента - Строка
// 
// Возвращаемое значение:
//  Строка - Имя элемента владелец ответственного лица
Функция ИмяЭлементаВладелецОтветственногоЛица(ИмяЭлемента) Экспорт
	Если ИмяЭлемента = "ПредставительЗаказчикаФИО" Или ИмяЭлемента = "РуководительЗаказчикаФИО" Тогда
		Возврат "Заказчик";
	ИначеЕсли ИмяЭлемента = "ПредставительПоставщикаФИО" Тогда
		Возврат "Контрагент";
	ИначеЕсли ИмяЭлемента =  "ПредставительСтроительныйКонтрольФИО" Тогда
		Возврат "КонтрагентСтроительныйКонтроль";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

// Параметры установки свойства параметры выбора ответственного лица.
// 
// Возвращаемое значение:
//  Структура - Параметры установки свойства параметры выбора ответственного лица:
// * ЗначениеРеквизита - Неопределено, Строка, СправочникСсылка.ОтветственныеЛицаКонтрагентов, СправочникСсылка.Сотрудники - 
// * Контрагент - Неопределено, СправочникСсылка.Контрагенты - 
// * Организация - Неопределено, СправочникСсылка.Организации - 
// * РодительскийРеквизит - Строка -
// * РеквизитОрганизация - Строка -
// * РеквизитКонтрагент - Строка -
// * ИзменениеСвязиПараметровВыбора - Неопределено, ОписаниеОповещения -
Функция ПараметрыУстановкиСвойстваПараметрыВыбораОтветственногоЛица() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ЗначениеРеквизита", Неопределено);
	Результат.Вставить("Контрагент", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("РодительскийРеквизит", "");
	Результат.Вставить("РеквизитОрганизация", "Организация");
	Результат.Вставить("РеквизитКонтрагент", "");
	Результат.Вставить("ИзменениеСвязиПараметровВыбора", Неопределено);
	
	Возврат Результат;
КонецФункции


#КонецОбласти

#Область ГолосованиеКомиссии

// Установить решение в строках документа.
// 
// Параметры:
//  Табличнаячасть - ТабличнаяЧасть
//  РешениеСотрудника - Строка
//  ВоВсехСтроках - Булево - Во всех строках
//  ВыделенныеСтроки - Неопределено, Массив из СтрокаТабличнойЧасти - Выделенные строки
Процедура УстановитьРешениеВСтрокахДокумента(Табличнаячасть, РешениеСотрудника, ВоВсехСтроках = Истина, ВыделенныеСтроки = Неопределено) Экспорт
	
	РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.ПустаяСсылка");
	Если РешениеСотрудника = "За" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За");
	ИначеЕсли РешениеСотрудника = "Против" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против");
	КонецЕсли;
	
	Если ВоВсехСтроках Тогда
		Для Каждого СтрокаДокумента Из ТабличнаяЧасть Цикл
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	Иначе
		Для Каждого ИдентификаторВыделеннойСтроки Из ВыделенныеСтроки Цикл
			СтрокаДокумента = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Результаты голосования сотрудника.
// 
// Параметры:
//  ТаблицаДокумента - ТабличнаяЧасть
// 
// Возвращаемое значение:
//  Массив из Структура - Результаты голосования сотрудника
Функция РезультатыГолосованияСотрудника(ТаблицаДокумента) Экспорт
	
	РезультатыГолосования = Новый Массив;
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		Если ЗначениеЗаполнено(СтрокаДокумента.РешениеСотрудникаПоРезолюции) Тогда
			РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
				СтрокаДокумента.ИдентификаторСтроки, СтрокаДокумента.РешениеСотрудникаПоРезолюции);
			РезультатыГолосования.Добавить(РезультатГолосования);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатыГолосования;
	
КонецФункции

// Параметры управления элементами голосования.
// 
// Возвращаемое значение:
//  Структура - Параметры управления элементами голосования:
// * ОбрабатываемыеЭлементы - Структура:
// 	** ДоступныеЕслиНеМодифицированность - Массив из Строка 
// 	** ВидимыеВсегда - Массив из Строка 
// 	** ВидимыеЕслиВыбранСотрудник - Массив из Строка 
// 	** НевидимыеВсегда - Массив из Строка 
// 	** ВидимыеЕслиНеВыбранСотрудник - Массив из Строка 
// 	** ДоступныеЕслиМодифицированность - Массив из Строка 
// * ДоступностьГолосования - Булево - 
// * УправляющийРеквизит - Булево - 
// * Модифицированность - Булево - 
// * Сотрудник - СправочникСсылка.Сотрудники - 
// * ИспользуемыеИмена - Структура
Функция ПараметрыУправленияЭлементамиГолосования() Экспорт
	Результат = Новый Структура;
	
	// Изменяемые элементы
	Результат.Вставить("ОбрабатываемыеЭлементы", Новый Структура);
	Результат.ОбрабатываемыеЭлементы.Вставить("ДоступныеЕслиНеМодифицированность", Новый Массив);
	Результат.ОбрабатываемыеЭлементы.ДоступныеЕслиНеМодифицированность.Добавить("Сотрудник"); 
	Результат.ОбрабатываемыеЭлементы.Вставить("ВидимыеВсегда", Новый Массив);
	Результат.ОбрабатываемыеЭлементы.ВидимыеВсегда.Добавить("Сотрудник"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеВсегда.Добавить("ИтогГолосования"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеВсегда.Добавить("РезолюцияОдобрена"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеВсегда.Добавить("СохранитьРезультаты"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеВсегда.Добавить("НадписьГолосование"); 
	Результат.ОбрабатываемыеЭлементы.Вставить("ВидимыеЕслиВыбранСотрудник", Новый Массив);
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиВыбранСотрудник.Добавить("НадписьФайл"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиВыбранСотрудник.Добавить("ЗаВоВсехСтроках"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиВыбранСотрудник.Добавить("ПротивВоВсехСтроках"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиВыбранСотрудник.Добавить("ЗаВВыделенныхСтроках"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиВыбранСотрудник.Добавить("ПротивВВыделенныхСтроках"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиВыбранСотрудник.Добавить("РешениеСотрудника");
	Результат.ОбрабатываемыеЭлементы.Вставить("НевидимыеВсегда", Новый Массив);
	Результат.ОбрабатываемыеЭлементы.НевидимыеВсегда.Добавить("ФайлСотрудника"); 
	Результат.ОбрабатываемыеЭлементы.НевидимыеВсегда.Добавить("ФайлСотрудника1"); 
	Результат.ОбрабатываемыеЭлементы.НевидимыеВсегда.Добавить("НадписьУдалитьФайл"); 
	Результат.ОбрабатываемыеЭлементы.НевидимыеВсегда.Добавить("НадписьУдалитьФайл1"); 
	Результат.ОбрабатываемыеЭлементы.НевидимыеВсегда.Добавить("НадписьФайлНеВыбран"); 
	Результат.ОбрабатываемыеЭлементы.НевидимыеВсегда.Добавить("НадписьФайлНеВыбран1"); 
	Результат.ОбрабатываемыеЭлементы.Вставить("ВидимыеЕслиНеВыбранСотрудник", Новый Массив);
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиНеВыбранСотрудник.Добавить("ЕдиногласноЗаВоВсехСтроках"); 
	Результат.ОбрабатываемыеЭлементы.ВидимыеЕслиНеВыбранСотрудник.Добавить("ЕдиногласноПротивВоВсехСтроках"); 
	Результат.ОбрабатываемыеЭлементы.Вставить("ДоступныеЕслиМодифицированность", Новый Массив);
	Результат.ОбрабатываемыеЭлементы.ДоступныеЕслиМодифицированность.Добавить("СохранитьРезультаты");
	
	// Значения управляющих реквизитов
	Результат.Вставить("ДоступностьГолосования", Ложь); 
	Результат.Вставить("УправляющийРеквизит", Ложь);
	Результат.Вставить("Модифицированность", Ложь);
	Результат.Вставить("Сотрудник", ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
	
	// Соответствие используемых имен
	Результат.Вставить("ИспользуемыеИмена", Новый Структура); 
	
	Возврат Результат;
	
КонецФункции

// Управление элементами голосования.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Параметры - см. ПараметрыУправленияЭлементамиГолосования
Процедура УправлениеЭлементамиГолосования(Форма, Параметры) Экспорт

	УстановитьСвойствоЭлементов(Форма.Элементы,
		Параметры.ОбрабатываемыеЭлементы.ДоступныеЕслиНеМодифицированность,
		"Доступность",
		Параметры.ДоступностьГолосования,
		Параметры.УправляющийРеквизит, Параметры.ИспользуемыеИмена);

	УстановитьСвойствоЭлементов(Форма.Элементы,
		Параметры.ОбрабатываемыеЭлементы.ВидимыеВсегда,
		"Видимость",
		Истина,
		Параметры.УправляющийРеквизит,
		Параметры.ИспользуемыеИмена);
	
	УстановитьСвойствоЭлементов(Форма.Элементы,
		Параметры.ОбрабатываемыеЭлементы.ВидимыеЕслиВыбранСотрудник,
		"Видимость",
		?(Параметры.ДоступностьГолосования И ЗначениеЗаполнено(Параметры.Сотрудник), Истина, Неопределено),
		Параметры.УправляющийРеквизит,
		Параметры.ИспользуемыеИмена);

	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		Параметры.ОбрабатываемыеЭлементы.НевидимыеВсегда,
		"Видимость",
		Ложь);

	УстановитьСвойствоЭлементов(Форма.Элементы,
		Параметры.ОбрабатываемыеЭлементы.ВидимыеЕслиНеВыбранСотрудник,
		"Видимость",
		?(Параметры.ДоступностьГолосования И Не ЗначениеЗаполнено(Параметры.Сотрудник), Истина, Неопределено),
		Параметры.УправляющийРеквизит,
		Параметры.ИспользуемыеИмена);
		
	УстановитьСвойствоЭлементов(Форма.Элементы,
		Параметры.ОбрабатываемыеЭлементы.ДоступныеЕслиМодифицированность,
		"Доступность",
		?(Параметры.ДоступностьГолосования И ЗначениеЗаполнено(Параметры.Сотрудник) И Параметры.Модифицированность, Истина, Неопределено),
		Параметры.УправляющийРеквизит,
		Параметры.ИспользуемыеИмена);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСвойствоЭлементов(Элементы, ИдентификаторыИмен, Свойство, ЗначениеСвойства, УправляющийРеквизит, ИспользуемыеИмена)
	ЭлементыФормы = Новый Массив;
	Для Каждого ИдентификаторИмени Из ИдентификаторыИмен Цикл
		ЭлементыФормы.Добавить(ИспользуемыеИмена[ИдентификаторИмени][УправляющийРеквизит]);
	КонецЦикла;
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыФормы, Свойство,
		?(ЗначениеСвойства = Неопределено, Ложь, ЗначениеСвойства));

	ЭлементыФормы = Новый Массив;
	Для Каждого ИдентификаторИмени Из ИдентификаторыИмен Цикл
		ЭлементыФормы.Добавить(ИспользуемыеИмена[ИдентификаторИмени][Не УправляющийРеквизит]);
	КонецЦикла;
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыФормы, Свойство,
		?(ЗначениеСвойства = Неопределено, Ложь, Не ЗначениеСвойства));
КонецПроцедуры

#КонецОбласти
